tutorials/incompressible/icoDyMFoam/movingConeMotion/system/tetFemSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      tetFemSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    motionU
    {
        solver           CG;
        preconditioner   Cholesky;

        minIter          0;
        maxIter          1000;
        tolerance        1e-6;
        relTol           0.0;
    }
//     motionU
//     {
//         solver          amgSolver;
//         cycle           W-cycle;
//         policy          AAMG;
//         nPreSweeps      0;
//         nPostSweeps     2;
//         groupSize       4;
//         minCoarseEqns   30;
//         nMaxLevels      100;
//         scale           on;
//         smoother        GaussSeidel;

//         minIter         0;
//         maxIter         500;
//         tolerance       1e-8;
//         relTol          0.0;
//     }
}

// ************************************************************************* //
